[
  {
    "name": "Jaydip Sinh",
    "review": "The flavors at Spice Hub are absolutely authentic! Their biryani and butter chicken are simply amazing. A must-visit for anyone craving real Indian taste.",
    "rating": 5
  },
  {
    "name": "Jay Rathod",
    "review": "Great ambiance and friendly staff. Loved the masala chai and the spicy samosas. Perfect spot for a quick snack or a relaxed evening.",
    "rating": 4
  },
  {
    "name": "Tej Sinh",
    "review": "I enjoyed every bite of their paneer tikka and garlic naan. The service was fast, and the place is very clean. Highly recommend Spice Hub!",
    "rating": 5
  },
  {
    "name": "Ratan Sinh",
    "review": "Spice Hub has the best thali in town! The balance of spices is just right, and the dal makhani tastes just like homemade. Will definitely come back.",
    "rating": 5
  },
  {
    "name": "Meena Patel",
    "review": "Lovely cafe with delicious snacks. The vada pav and chai combo is my favorite. Cozy place to hang out with friends.",
    "rating": 4
  },
  {
    "name": "Amit Desai",
    "review": "If you love street food with a twist, this place is for you. The pav bhaji here is spicy and flavorful. Great value for money.",
    "rating": 4
  },
  {
    "name": "Priya Shah",
    "review": "The freshly brewed coffee and the crispy pakoras made my day. The staff were very welcoming and attentive. Highly recommended!",
    "rating": 5
  },
  {
    "name": "Vikram Solanki",
    "review": "Authentic flavors and warm hospitality. Their dosa and chutneys are a perfect start to the day. Definitely coming back soon.",
    "rating": 5
  },
  {
    "name": "Nisha Reddy",
    "review": "Perfect place for families. The kids loved the gulab jamun and we enjoyed the spicy chaat. Clean and comfortable environment.",
    "rating": 4
  },
  {
    "name": "Rakesh Mehta",
    "review": "Excellent food, excellent service. The naan and kebabs are to die for. A great experience every time I visit Spice Hub.",
    "rating": 5
  }
]
